using UnityEngine;

public class StudyObjectOriented : MonoBehaviour
{
    // オブジェクト指向 object-oriented
    // Unity でプログラミングする際に使用する言語 C#
    // C# はオブジェクト指向言語と言われている。

    // オブジェクト指向とは現実の物のようにプログラミングして行く考え方。
    // 概念的なことが多いプログラミングで実際の物のように扱うことで人間に理解しやすい。
    // 理解しやすいということはバグ等が発生しにくい。

    // またゲームは比較的、キャラクターや敵や、武器のような物として考えることが多い
    // オブジェクト指向はゲーム開発向きだと思います。

    // オブジェクト指向でプログラミングできる言語
    // UEで使用する      C++
    // 日本の開発で人気な Java 
    // AI開発で人気      Python 


    // オブジェクト指向は現実の物のようにプログラミングできるので人間にも理解しやすい
    // 人間にも理解しやすい、ドンドン機能が追加されて、人間には理解できない。
    // スパゲッティコードとか言われている現象

    // スパゲッティコードを防ぐ方法として
    // オブジェクト指向の３要素
    // ・カプセル化
    // ・継承
    // ・ポリモーフィズム
}
